princeton/ipvs/results/timeseries/time-varying/1_X_max/saturated-all-backends/500ms-fluctuation/5mins-run/feedback-wlc/run/httperf_client_123.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=8 --send-buffer=4096 --recv-buffer=16384 --num-conns=2400 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
           421.5 1
             :
           442.5 1
             :
           449.5 1
             :
           451.5 1
             :
           467.5 1
             :
           480.5 1
             :
           486.5 1
             :
           490.5 1
             :
           492.5 1
           493.5 1
             :
           498.5 1
             :
           500.5 1
             :
           503.5 1
             :
           507.5 2
           508.5 1
             :
           510.5 2
             :
           512.5 2
             :
           514.5 2
           515.5 1
           516.5 2
             :
           518.5 1
           519.5 5
           520.5 2
           521.5 1
             :
           523.5 4
           524.5 2
           525.5 1
           526.5 3
           527.5 2
           528.5 5
           529.5 2
           530.5 4
           531.5 3
           532.5 2
           533.5 4
           534.5 1
           535.5 3
           536.5 3
           537.5 5
           538.5 3
           539.5 4
           540.5 3
           541.5 8
           542.5 7
           543.5 3
           544.5 3
           545.5 4
           546.5 5
           547.5 2
           548.5 3
           549.5 6
           550.5 3
           551.5 6
           552.5 10
           553.5 5
           554.5 3
           555.5 4
             :
           557.5 5
           558.5 4
           559.5 6
           560.5 3
           561.5 7
           562.5 4
           563.5 2
           564.5 3
           565.5 5
           566.5 7
           567.5 5
           568.5 5
           569.5 5
           570.5 4
           571.5 5
           572.5 3
           573.5 3
           574.5 1
           575.5 4
           576.5 5
           577.5 4
           578.5 4
           579.5 1
           580.5 5
           581.5 3
           582.5 2
           583.5 5
           584.5 3
           585.5 2
           586.5 2
           587.5 3
           588.5 5
           589.5 2
           590.5 3
           591.5 1
           592.5 3
           593.5 1
           594.5 3
           595.5 5
           596.5 6
           597.5 3
           598.5 1
           599.5 3
             :
           601.5 2
           602.5 3
           603.5 2
           604.5 5
           605.5 2
           606.5 4
           607.5 6
           608.5 3
           609.5 2
           610.5 5
           611.5 2
           612.5 3
           613.5 1
           614.5 3
             :
           616.5 9
           617.5 2
           618.5 1
           619.5 1
           620.5 1
           621.5 4
           622.5 3
           623.5 1
           624.5 2
           625.5 5
             :
           627.5 5
           628.5 2
           629.5 3
           630.5 7
           631.5 4
           632.5 3
             :
           634.5 4
           635.5 5
           636.5 3
           637.5 4
           638.5 5
           639.5 3
           640.5 3
           641.5 6
           642.5 2
           643.5 3
           644.5 2
           645.5 2
           646.5 4
           647.5 5
           648.5 4
             :
           650.5 5
           651.5 5
           652.5 6
           653.5 2
           654.5 7
           655.5 5
           656.5 3
           657.5 8
           658.5 2
           659.5 7
           660.5 1
           661.5 1
           662.5 6
           663.5 4
           664.5 4
           665.5 2
           666.5 7
           667.5 6
           668.5 3
           669.5 4
           670.5 4
           671.5 6
           672.5 4
           673.5 2
           674.5 1
           675.5 3
           676.5 6
           677.5 7
           678.5 4
           679.5 5
           680.5 7
           681.5 3
           682.5 9
           683.5 4
           684.5 7
           685.5 10
           686.5 8
           687.5 5
           688.5 6
           689.5 8
           690.5 3
           691.5 2
           692.5 10
           693.5 11
           694.5 7
           695.5 7
           696.5 4
           697.5 5
           698.5 9
           699.5 8
           700.5 8
           701.5 6
           702.5 7
           703.5 7
           704.5 7
           705.5 10
           706.5 8
           707.5 6
           708.5 7
           709.5 10
           710.5 7
           711.5 11
           712.5 17
           713.5 13
           714.5 7
           715.5 9
           716.5 9
           717.5 10
           718.5 6
           719.5 4
           720.5 8
           721.5 10
           722.5 9
           723.5 14
           724.5 9
           725.5 9
           726.5 9
           727.5 7
           728.5 5
           729.5 11
           730.5 12
           731.5 12
           732.5 8
           733.5 5
           734.5 6
           735.5 11
           736.5 11
           737.5 4
           738.5 12
           739.5 12
           740.5 6
           741.5 11
           742.5 13
           743.5 13
           744.5 6
           745.5 9
           746.5 13
           747.5 9
           748.5 10
           749.5 10
           750.5 7
           751.5 11
           752.5 8
           753.5 15
           754.5 8
           755.5 13
           756.5 15
           757.5 13
           758.5 10
           759.5 6
           760.5 4
           761.5 11
           762.5 4
           763.5 7
           764.5 13
           765.5 10
           766.5 10
           767.5 12
           768.5 13
           769.5 15
           770.5 12
           771.5 10
           772.5 14
           773.5 13
           774.5 5
           775.5 7
           776.5 6
           777.5 8
           778.5 6
           779.5 8
           780.5 13
           781.5 8
           782.5 6
           783.5 6
           784.5 11
           785.5 6
           786.5 8
           787.5 11
           788.5 11
           789.5 11
           790.5 3
           791.5 17
           792.5 8
           793.5 17
           794.5 6
           795.5 17
           796.5 6
           797.5 7
           798.5 8
           799.5 6
           800.5 4
           801.5 7
           802.5 8
           803.5 7
           804.5 12
           805.5 5
           806.5 16
           807.5 9
           808.5 7
           809.5 4
           810.5 8
           811.5 5
           812.5 8
           813.5 9
           814.5 8
           815.5 8
           816.5 5
           817.5 8
           818.5 6
           819.5 7
           820.5 4
           821.5 8
           822.5 2
           823.5 8
           824.5 11
           825.5 11
           826.5 7
           827.5 7
           828.5 7
           829.5 10
           830.5 7
           831.5 8
           832.5 4
           833.5 6
           834.5 5
           835.5 10
           836.5 3
           837.5 4
           838.5 7
             :
           840.5 7
           841.5 6
           842.5 8
           843.5 5
           844.5 5
           845.5 2
           846.5 2
           847.5 2
           848.5 7
           849.5 3
           850.5 2
             :
           852.5 6
           853.5 2
           854.5 8
           855.5 6
           856.5 2
           857.5 1
           858.5 4
           859.5 2
           860.5 10
           861.5 3
           862.5 4
           863.5 3
           864.5 2
           865.5 3
           866.5 1
           867.5 4
           868.5 2
             :
           870.5 3
           871.5 2
           872.5 8
           873.5 4
           874.5 2
           875.5 3
           876.5 4
           877.5 3
           878.5 1
           879.5 7
           880.5 5
           881.5 3
           882.5 4
           883.5 1
           884.5 2
           885.5 3
           886.5 5
           887.5 2
           888.5 6
           889.5 5
           890.5 2
           891.5 3
           892.5 2
           893.5 2
           894.5 1
           895.5 4
           896.5 2
           897.5 4
             :
           900.5 4
           901.5 1
           902.5 1
           903.5 5
           904.5 2
           905.5 4
           906.5 2
           907.5 6
           908.5 3
           909.5 1
           910.5 3
           911.5 3
           912.5 4
           913.5 2
           914.5 3
           915.5 4
           916.5 2
           917.5 1
           918.5 2
           919.5 1
           920.5 5
             :
           922.5 3
           923.5 4
           924.5 1
           925.5 2
           926.5 2
           927.5 2
           928.5 2
           929.5 1
           930.5 5
           931.5 3
             :
           933.5 6
           934.5 3
             :
           936.5 3
           937.5 3
           938.5 1
           939.5 3
           940.5 4
           941.5 2
           942.5 5
           943.5 3
           944.5 3
           945.5 3
           946.5 1
           947.5 2
           948.5 3
             :
           950.5 2
           951.5 2
             :
           953.5 1
           954.5 4
           955.5 7
           956.5 3
           957.5 3
           958.5 5
           959.5 2
           960.5 2
           961.5 2
           962.5 1
           963.5 2
             :
           965.5 2
           966.5 1
           967.5 3
           968.5 1
           969.5 2
             :
           971.5 2
           972.5 2
           973.5 2
             :
           975.5 1
             :
           977.5 1
           978.5 1
           979.5 1
           980.5 2
           981.5 2
           982.5 1
             :
           984.5 1
           985.5 3
           986.5 2
             :
           988.5 4
           989.5 1
           990.5 1
           991.5 2
           992.5 2
           993.5 2
           994.5 1
             :
           996.5 2
             :
           998.5 1
             :
          1002.5 2
             :
          1004.5 1
             :
          1006.5 1
          1007.5 1
          1008.5 2
          1009.5 1
             :
          1011.5 1
          1012.5 2
             :
          1014.5 1
             :
          1019.5 1
             :
          1021.5 1
          1022.5 1
          1023.5 4
          1024.5 1
             :
          1026.5 1
             :
          1031.5 1
             :
          1038.5 1
             :
          1040.5 2
             :
          1044.5 1
             :
          1052.5 1
          1053.5 1
             :
          1060.5 1
             :
          1065.5 1
             :
          1069.5 1
             :
          1073.5 1
          1074.5 1
             :
          1080.5 1
             :
          1099.5 1
             :
          1104.5 1
             :
          1131.5 1
             :
          1139.5 1
             :
          1157.5 1
             :
          1200.5 1
             :
          1310.5 1

Total: connections 2400 requests 2400 replies 2400 test-duration 300.564 s

Connection rate: 8.0 conn/s (125.2 ms/conn, <=9 concurrent connections)
Connection time [ms]: min 421.1 avg 748.9 max 1310.4 median 751.5 stddev 117.2
Connection time [ms]: connect 1.3
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (125.2 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 2.0 avg 8.0 max 11.0 stddev 1.1 (300 samples)
Percentages of the replies served at a given rate:
   50%: 7
   66%: 7
   75%: 8
   80%: 8
   90%: 8
   95%: 9
   98%: 9
   99%: 9
  100%: 11

Reply time [ms]: response 670.1 transfer 77.4
Percentages of the requests served within a certain time (ms) :
   50%: 656
   66%: 732
   75%: 766
   80%: 784
   90%: 824
   95%: 866
   98%: 933
   99%: 979
  100%: 1309

Reply size [B]: header 163.0 content 72.0 footer 2.0 (total 237.0)
Reply status: 1xx=0 2xx=2400 3xx=0 4xx=0 5xx=0

CPU time [s]: user 219.56 system 80.54 (user 73.0% system 26.8% total 99.8%)
Net I/O: 2.4 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0